
IPv6ルーティングの有効化
hostname(config)#ipv6 unicast-routing

手動設定
hostname(config-if)#ipv6 address <アドレス> <プレフィクス長> [eui-64]
Eui-64を指定した場合、アドレスはプレフィクス部分だけを入力すればok。

オートコンフィギュレーションによる自動設定　SLAAC　ステートレス
hostname(config-if)#ipv6 address autoconfig

DHCPサーバによる自動設定　ステートフル
hostname(config-if)#ipv6 address dhcp

ルータにIPアドレスを割り当てる
hostname(config-if)#ip address <アドレス> <サブネットマスク>
hostname(config-if)#no shutdown　　インターフェースごとに割り当て、ワークスペース上に追記しておく

各PCのconfigから最寄りのルータのIPアドレスをデフォルトゲートウェイに登録


コンソールパスワードの設定
hostname(config)#line console 0
hostname(config-line)#password <パスワード>
hostname(config-line)#login

イネーブルパスワード
hostname(config)#enable password <パスワード>

VTYパスワード
hostname(config)#line vty <開始ライン番号> <終了ライン番号>　終了ライン番号を省略すると、開始ライン番号のみの設定となる

ローカル認証
hostname(config)#username <名前> priviledge <特権レベル> password <パスワード>　特権レベルは0~15までのどれか
hostname(config)#line console 0
hostname(config-line)#login local

イネーブルパスワードの暗号化
hostname(config)#enable secret <パスワード>

コンソール・VTYパスワードの暗号化
hostname(config)#service password-encryption


ルーティングテーブルの確認
hostname#show ip route

Cは直接接続されているノード　Lはそのルータ自身のIPアドレス


スタティックルーティングの設定
hostname(config)#ip route <宛先IPアドレス> <宛先のサブネットマスク> <ネクストホップor出力インタフェース> <AD値>　
ネクストホップは宛先に向かうまでの一番近いルータのインタフェース　AD値は変更したい時だけ入力する


OSPFの設定
hostname(config)#router ospf <プロセスID>　プロセスIDは1~65535のうちなんでも良いが、普通「１」
hostname(config-router)#network <アドレス> <ワイルドカードマスク> area <エリアID>　アドレスは有効にしたいネットワークアドレス。 
ワイルドカードマスクはアドレスの一致範囲を示すもの。サブネットマスクを二進数表記で反転させたもの。0.0.0.255 のような表記になる。完全一致したものだけ指定する場合、0.0.0.0を入力する。
エリアIDは所属するものを指定する。エリアが一つの場合はシングルエリアと呼ばれ、通常エリア０を使用する。


DR,BDR選出のためのルータIDを設定
hostname(config)#router-id <ルータID>

ループバックインターフェースを設定する
hostname(config)#interface Loopback <番号>

ネイバーのOSPFを確認
hostname#show ip ospf neighbor

インターフェースのOSPFを確認　
hostname#show ip ospf interface <インターフェース>


デフォルトルートの設定
hostname(config)# ip route 0.0.0.0 0.0.0.0 <ネクストホップor出力インタフェース>



標準ACLの設定
hostname(config)#access-list <番号> <permit or deny> <IPアドレス> <ワイルドカードマスク>
番号は1~99もしくは1300~1999から選ぶ。
Premitは許可　denyは拒否　IPアドレスは送信元を入力　ワイルドカードは一つだけ指定のため0.0.0.0

ACLの適用
hostname(config-if)#ip access-group <番号> <in or out>
番号は、すでに設定したものと同じもの　　inはインバウンド　outはアウトバウンド

拡張ACLの設定
hostname(config)#access-list <番号> <permit or deny> <プロトコル> <送信元IPアドレス> <ワイルド> <宛先IPアドレス> <ワイルド> <オプション>
番号は100~199もしくは2000~2699が指定可能。プロトコルはipやtclなど。オプションはなくても良い
